{
    "default": [
        {
            "bio": "i am studying towards an electronic engineering degree at  national university of science and technology and currently in my fourth year. i am an intern at Afrosoft. I am a self motivated programmer who ranks python as my favourite language. i live in mutare . I love teaching other people programming. I love technology and hope to contribute in any way possible to the python community.", 
            "description": "I would be talking about the advantages of using kivy for mobile application development . I would show how to develop the application through code snippets,  install kivy via pip, show the basic architecture of kivy and the basic components of kivy like widgets.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "7cdea0d8-3395-473a-9a99-c5b919db12b3", 
            "votes": [
                ""
            ], 
            "twitter": "@wendinoda", 
            "title": "Developing hybrid applications with kivy", 
            "speaker": "wendinoda washaya", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Mike Place is on the core engineering team for SaltStack -- one of the largest Python-based OSS projects in the world.", 
            "description": "This workshop will explain how to use SaltStack to manage and deploy your Python-based applications. We'll give an overview of Salt and learn how to use Salt's configuration management engine to keep servers running and configured and provide a repeatable automation pipeline for your systems. Best of all, we'll talk about how to extend Salt with Python to automate just about anything.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "f5229725-4a87-445f-b10a-13a47925805c", 
            "votes": [
                ""
            ], 
            "twitter": "@cachedout", 
            "title": "Automation with SaltStack", 
            "speaker": "Mike Place", 
            "end_time": "13:20", 
            "type": "workshop or tutorial", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Business Developer and an Python Enthusiastic", 
            "description": "Present on the advantages of GUI in python and its importance", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "fc0d6caf-8d7c-4c38-a470-312db6a9d0b5", 
            "votes": [
                ""
            ], 
            "twitter": "@tatekevvy", 
            "title": "Importance of GUI in fields of Statistics, Accounting, Business Environments", 
            "speaker": "Kelvin Mudzimuirema", 
            "end_time": "13:20", 
            "type": "workshop or tutorial", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Petrus started out as a Mechanical Engineer, then turned into a Software Developer, and now he's an Entrepreneur, selling groceries via an Android app which is aimed at emerging-market consumers. He lives in Cape Town, with his wife and baby girl.", 
            "description": "Python is fun. But becoming a great software developer can be a long, hard and intimidating process without the right support.\n\nIn this talk I want to highlight some of the best resources that I have found for learning to code and then mastering specific topics. The aim is for everyone to walk away with a better understanding of where to start and how to keep going when it comes to planning a career in software development.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "5d42c322-c80f-4092-bd5f-905af21d977a", 
            "votes": [
                ""
            ], 
            "twitter": "@petrusjvr", 
            "title": "From Zero to Ninja - how to master software development with Python", 
            "speaker": "Petrus Janse van Rensburg", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "...same as for previous submission", 
            "description": "In this talk I will describe my own experience of building out the tech stack for a mobile e-commerce startup. It will cover: \n• an overview of the main design challenges \n• the chosen architecture (database, server-side application layer, API and mobile client) \n• how I used Flask to build the API \n• how I used Flask-Admin to build a management console.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "1afe8ee2-c425-409f-9c63-57870f868abe", 
            "votes": [
                ""
            ], 
            "twitter": "@petrusjvr", 
            "title": "Selling groceries online using Postgres, Flask, Docker & Android", 
            "speaker": "Petrus Janse van Rensburg", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "\nI not only write code, but as long as I can remember. I have been writing, writing a lot :). I also am a very good public speaker who speaks well and from the heart. This passion for speaking has resulted in me participating a lot in debates and many public speaking events. I like to speak on issues that affect the minors in society (no cliche!)\n\nI am very outgoing and I truly believe that the best information comes from the greatest resource we have on this earth - people.I believe in the power of interpersonal skills and I learn everyday how to perfect it.\n\nI love my life, I love my job.\n\n\nCheck my blog at\n\nslanderous.blogspot.com", 
            "description": "A brief talk on the power of python in the workplace. From automating routine tasks,demos of scripts I've written to cut down on time taken. Data analysis, fun things and a brief intro to python with machine learning. ", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "76871363-4485-41d3-a3ab-1553642722e8", 
            "votes": [
                ""
            ], 
            "twitter": "@simakk", 
            "title": "Automate!", 
            "speaker": "Shingirayi Innocent Mandebvu", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I am a lecturer within the School of Computing at the University of Namibia. I mostly specialise in Computer Networks and Information Systems. Within the sphere of Information Systems my colleagues and I investigate how software can be designed for African contexts. Further, we also study the impact of technology on rural communities. I am passionate about PyCon's as they provide an opportunity to interact with people along the software life cycle.", 
            "description": "In the world of technology we often tend to focus on the technical aspects of software products. However we tend to neglect the main component that determines whether a software application / artifact is a success or failure: the user. Within this talk I will be going through three (3) commands that I live by when working on software projects and they all revolve around principles of USER CENTERED DESIGN. This talk is aimed at everyone from beginners to Experts.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "b90ea315-af90-4867-963d-514f3229b2b1", 
            "votes": [
                ""
            ], 
            "twitter": "@shingapi", 
            "title": "UX Design: For Developers or Nah?", 
            "speaker": "Gabriel Tuhafeni Nhinda", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Tendai Marengereke is an Information Security professional with significant experience and expertise in Areas of Information Security, Computer Forensics. He is also a lecturer at Harare Institute of Technology and he is passionate about  Python. ", 
            "description": "The talk is on Reproducible Research in Python. The goal of reproducible research is to tie specific instructions to data analysis and experimental data so that scholarship can be recreated, better understood and verified. Often projects are created and kept but it is hard to replicate the results or follow the path used by a researcher. This talk will be on how to achieve reproduciblity  in Python. ", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "c649c21c-5c1a-4c85-95e2-582cd5509025", 
            "votes": [
                ""
            ], 
            "twitter": "@marengz", 
            "title": "Reproducible Research in Python", 
            "speaker": "Tendai Marengereke", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Ziyaad Parker is currently the Data Manager for the Computational Biology Department at the University of Cape Town. In this position he is primarily responsible for developing the database archive, which will be used as a repository for all submissions of data by H3Africa groups to EGA. With support of the Data Management Task Force, he will also help develop tools that allow users to search this data in order to plan future projects. Ziyaad is a graduate of UCT and brings valuable skills to the department. To facilitate the project, he is in the process of developing an interactive Archive Web Portal. The portal intends to track all the progress of the data submissions. This will require the development of a front-end user interface as well as back-end. The technologies that will be used for the front-end are HTML, CSS, JavaScript and Bootstrap. Back-end technologies include Python, the Django Web Framework, Python with a range of libraries, PostgreSQL and Ubuntu. He will maintain the security of the system, support users with data submission and facilitate the data transfer. Making the data available via an online catalogue for users to have a user friendly interface to search, extract, report and visualize the data. Example searching for a disease in a certain country.  ", 
            "description": "The NIH and Welcome Trust have funded multiple projects on genomic research and data is required to be deposited into a public domain. The European Genome-phenome Archive (EGA) is the repository for sequence and genotype data where the Data access is controlled by access committees. \n\nAccess is determined by a formal application procedure for the purpose of secure storage and distribution. Informed consents are required for specifying controlled release requirements. Researchers from the H3Africa data generating projects based in Africa can benefit tremendously from the data sharing capabilities of the internet by using the appropriate technologies. The H3Africa Data Archive is the effort between the H3Africa data generating projects, H3ABionet and the EGA. \n\n\nTo facilitate the project, H3ABionet is in the process of developing an interactive Archive Web Portal. The portal intends to track all the progress of the data submissions. This will require the development of a front-end user interface as well as back-end. The technologies that will be used for the front-end are HTML, CSS, JavaScript and Bootstrap. The Django Web Framework, Python with a range of libraries, PostgreSQL and Ubuntu will be used for the back-end. H3ABionet will maintain the security of the system, support users with data submission and facilitate the data transfer.\n\n\nThis will enable users the opportunity to submit their data and keep track of their submission status. The goal is to ensure efficient data flow between researchers, the archive and the EGA. 9 months after the data is in secure storage, H3ABionet will convert the data into an XML format ready for submission to EGA.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "a202cb7e-71a7-407f-b3aa-49c788b0f491", 
            "votes": [
                ""
            ], 
            "twitter": null, 
            "title": "H3Africa Data Archive", 
            "speaker": "Ziyaad Parker", 
            "end_time": "13:20", 
            "type": "poster", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Achim is a self taught Full stack python developer, a .Net fanatic, a UI/UX designer who dreams elegant design, passionate gamer, style and fitness addict and just a great person to talk to.", 
            "description": "i will be talking about full stack development with major emphasis on the development of a scale able base for web applications with RESTful APIs using the Flask micro-framework.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "6df3e8d2-ce08-47fc-944e-82b79e85dcaf", 
            "votes": [
                ""
            ], 
            "twitter": "@achim_munene", 
            "title": "Flask for the REST of Us", 
            "speaker": "Achim munene", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }
    ], 
    "main": [
        {
            "bio": "Mike Place is on the core engineering team at SaltStack -- one of the largest open-source Python projects in the world.", 
            "description": "What's the best way to file a bug? What are some of the things you should *never* do when sending in a bug fix? What's the best way to structure a feature request to maximize the likelihood that it will get accepted? How can you find a way to help in a large project that might seem intimidating? In this talk, we'll hear advice from a maintainer of one of the world's largest Python open-source project about what you should (and shouldn't) do to contribute.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "08758e6a-4878-43a3-a2c8-c46944c86900", 
            "votes": [
                ""
            ], 
            "twitter": "@cachedout", 
            "title": "Best Practices for Contributing to Open Source", 
            "speaker": "Mike Place", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I'm a lead programmer for OPEXA, a Zimbabwean based start-up that specializes in developing administration systems and applications geared towards the financial sector. Over the past couple years, my focus has come to center around Django, Kivy and Blockchains, driven primarily by a love of Python and the urge to discover all of its potential.", 
            "description": "During this workshop I'll like to introduce everyone to the wonders of Kivy, a single platform to develop for Windows, Linux, Android or iOS, though my focus will primarily be on Android development. This tutorial will demonstrate to how powerful a tool Kivy can be in making elegant, simple applications.\n\nMy tutorial would cover several essential basic concepts and walk attendees through the process of setting up and running Kivy in a Linux environment. Attention would also be paid to describing techniques for laying out the structure of a project, the various widgets and their basic functionality as well as some quirks they might encounter, basic design and styling of GUI elements and storing and retrieving information on the device (for which I have a rudimentary library, based on Django's implementation of Models, developed during the course of my own work that I'd be happy to share).\n\nFinally, I would also demonstrate how to test and debug the code on a live Android device and create an apk using Buildozer, with some special attention accorded to including assets (specifically images and custom fonts) when packaging the application. Whilst I do not think this would be a process attendees could do themselves due to the amount of time it takes to initially set up Buildozer, they'll leave confident that they can turn their beautiful code into even more amazing real-world solutions.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "41444e20-4349-4646-a93c-577e98586141", 
            "votes": [
                ""
            ], 
            "twitter": null, 
            "title": "Kivy: From Zero to Android", 
            "speaker": "Tatenda. K. Tambo", 
            "end_time": "13:20", 
            "type": "workshop or tutorial", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I am an electronics electrical engineering student of the Obafemi Awolowo University .\nI am a core Python Web, Networking, Games and IOT programmer.. Coordinator of Python Club OAU. Organizer of DjangoGirls OAU.", 
            "description": "What are the secrets to getting the most out of Python as a student, a teacher or even an educational institution? Python and some of its third party tools use and provide some tools which when critically looked at would ease the static-ness and redundant approach of handling education and educational materials in not just Nigeria but the continent(Africa) as a whole.\n\nThis talk will consider two concepts generally relating to education and then highlight where Python comes in within each of them. I would then go ahead and state achievements made in education with Python. These concepts although quite general have helped me come to understand both the concepts of education, and Python in general.   1. Learning/Studentship :The core idea behind being a student is learning. At one point or another(or even most points in life), we're learning things. Also for everyone or anyone who calls him/herself a programmer, learning new,strange and sometimes frustrating technologies has become a thing to be familiar with. In an average Nigerian setting learning is not as efficient and easy as it should be. As a student myself often time I only read to pass examinations. In most cases students aren’t interested in the concepts or ideas behind what is being thought. Thats where Python comes in. For an ardent, serious student, Python could be not only as a tool for visualization (Mayavi,VisPy,mlab etc), calculations(numpy, math, cmath etc) but also as an enriching tool for academic breakthrough.   2. Teaching : Teaching is a lot more crucial than learning. This is because teaching determines what the student knows or doesn't know. Computer programming as a discipline has over the years grown to an extent that it is now bargained to be taught as a stand alone course in some institutions.  In most developed and advanced educational systems, the importance of students programming a computer has been emphasized to teachers, and as such most teachers have in one way or the other taken steps to learn computer programming in order to aid their teaching activities. This has reflected in quite a significant increase in academic performance for most students with such teachers. A teacher with a \"programming mind\" is a teacher with an upper edge and a teacher ready to solve problems for his/her students.  3. Introduce the audience to Python Club OAU.  ", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "6cfb8a30-1e7c-4a28-bf2f-9b6c0a30a84f", 
            "votes": [
                ""
            ], 
            "twitter": "@Olamyy_Fadil", 
            "title": "Python, Education and Africa", 
            "speaker": "Olamilekan Wahab", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Charles is a CIS-Graduate. He has worked as an Accountant & the dreaded profession of Auditor with over 5 years in Industry. He writes his code in either PHP or Python. He is very happy when setting up innovative web applications.", 
            "description": "Taking a new look at how a Stock Take can be conducted, with more accuracy, efficiency and speed.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "c445d286-d592-4a19-afd5-a46999ca5f51", 
            "votes": [
                ""
            ], 
            "twitter": "@charle-k", 
            "title": "Stocktaking, harnessing code in businesss", 
            "speaker": "Katuri Charles", 
            "end_time": "13:20", 
            "type": "workshop or tutorial", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Katuri Charles is a qualified accountant, who has the ability to code. Currently working on his own site http://www.kunet.co.zw and always forever learning the changes in coding environment.", 
            "description": "How African organisations could be harnessing custom coding solutions in pursuit of increasing efficiency, effectiveness & economy.  Will present case studies of possible opportunities for using code in everyday life", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "c7108ff9-d428-4941-b255-f602e21e2ffc", 
            "votes": [
                ""
            ], 
            "twitter": "@charle-k", 
            "title": "Coding - A paradigm shift in the use of coding technology in African Organisations", 
            "speaker": "Katuri Charles", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I am a Python/Django Developer, ICT Consultant, Django Girls Harare/Masvingo organiser and a Python enthusiast. ", 
            "description": "Zimbabwe currently has a very high literacy rate of over 90%, despite a very high literacy rate of 90%. While other countries are looking for skilled workers, the opposite is true for Zimbabwe, which has millions of skilled workers looking for employment. Fortunately, the Internet has turned the world into a global village, yes, everyone is talking about globalization! In my talk, I intend to share on the avenues of freelancing and remote working as possible employment/business opportunity for the ordinary, unemployed person in Zimbabwe. I will share on the benefits of both to the developer as well as the nation. I will also share on how to get started as a freelancer or remote worker, with the aim of presenting new and possible employment/entrepreneurship avenues for fellow developers in Zimbabwe.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "2cc7898c-993f-46d8-81af-70d936aa8ed1", 
            "votes": [
                ""
            ], 
            "twitter": "@amakarudze", 
            "title": "Freelance or Remote Working or Both?", 
            "speaker": "Anna Makarudze", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I am an intern developer at Siege Communications www.siegecommunications.com. I have been a system administrator for more than 5 years and recently decided to make the switch to full time development", 
            "description": "1. How new programmers can quickly assimilate new corporate culture and best practices through overcoming the impostor syndrome and fostering a growth mindset ", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "f7d2d296-0806-446d-b44d-d61fcb50a676", 
            "votes": [
                ""
            ], 
            "twitter": null, 
            "title": "A noob amongst the Pros (Dealing with the fears beginner programmers have when working with the experts)", 
            "speaker": "Matembudze Bornwell", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "I am a PhD in Finance student with Witwatersrand Business School, a full time lecturer at Bindura University of Science Education in the Banking and Finance Department. I am an enthusiast in the field of financial analytics and artificial intelligence.", 
            "description": "The need to embrace artificial intelligence technology for the build up of Zimbabwe. Talk will touch on possible AI application domains in Zimbabwe. ", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "f54ffbfb-6128-463b-82e4-4e32ea6a8344", 
            "votes": [
                ""
            ], 
            "twitter": "@dennis_dtmureka", 
            "title": "Be a Game Changer !!!", 
            "speaker": "Dennis Murekachiro", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Amanda Gelender is the Senior Manager of Social Impact at GitHub, the world’s largest open source community. She oversees GitHub’s flagship social impact projects including ConnectHome, a public-private partnership with the US Department of Housing and Urban Development to end the digital divide in US government-assisted and public housing. Amanda is currently building out flagship programming and partnerships for GitHub on the continent of Africa, with efforts based out of Lagos, Nigeria.\n\nAmanda is a writer and mental health advocate with 14 years of experience in social change work across sectors. She formerly worked at the Kapor Center for Social Impact, the American Civil Liberties Union of Northern California, and as the Director of Strategy & Innovation at Vaya Consulting, a firm dedicated to supporting tech companies with diversity and inclusion efforts. Amanda graduated from Stanford University with Honors, receiving the Stanford Award of Excellence, the Louis Sudler Prize for Excellence in the Arts, and the Robert M. Golden Medal for Excellence in Humanities and Creative Arts.", 
            "description": "Open source technology is catalyzing social change across the globe. In this keynote session, Amanda Gelender, GitHub's Senior Manager of Social Impact, will discuss the importance of lowering barriers to entry in technology innovation. You’ll walk away with an understanding of how developers can utilize their skills by contributing to open source projects that are creating waves of powerful change in communities across the globe.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "4491df1f-f03b-4013-824f-7e5a32520ec5", 
            "votes": [
                ""
            ], 
            "twitter": "@agelender", 
            "title": "Social Impact and Open Source: How Developers Can Drive Change ", 
            "speaker": "Amanda Gelender", 
            "end_time": "13:20", 
            "type": "something completely different", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Community Manager of B2C Coworking, Andrew is passionate about digital capacity development and the future of technology in Africa. He started B2C Coworking in June 2016 and has worked hard alongside several corporate partners to sustain it. Batanai to Create (B2C) means “Collaborate to Create”: it is Zimbabwe’s fastest growing innovation hub with over 20 startups under incubation. B2C also runs several ICT based programs that include Yali Creatives, Google Developer Groups, Digital Design training and Africa Code Week. Google Developer Groups Regional Mentor for Southern Africa (2016-2017), Andrew holds a Bachelors Degree in Electronic Commerce from the Harare Institute of Technology. ", 
            "description": "An introduction to the future of web apps (Progressive Web Apps). With the introduction of several new Web APIs leveling the playing field for web apps to native apps. The web and native mobile apps are about to go on a head to head battle of user experience.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "217c0652-8c3b-4746-8945-a4106a050cb1", 
            "votes": [
                ""
            ], 
            "twitter": "@andySitholeZW", 
            "title": "Progressive Web Apps", 
            "speaker": "Andrew", 
            "end_time": "13:20", 
            "type": "talk", 
            "start_date": "21.10.", 
            "avatar": ""
        }, 
        {
            "bio": "Humphrey is a Python, Django developer.", 
            "description": "A workshop/tutorial for Python/Django developers who would like to contribute more to the projects they use, but need more grounding in some of the tools required. The workshop will take participants through the complete cycle of identifying a simple issue in a Django or Python project, writing a patch with documentation, and submitting it.", 
            "end_date": "21.10.", 
            "start_time": "12:50", 
            "active": true, 
            "id": "cffbdcaf-cb66-4cda-a2f2-8cef88d18bd3", 
            "votes": [
                ""
            ], 
            "twitter": "@hamub", 
            "title": "Don`t be afraid to commit!", 
            "speaker": "Humphrey Butau", 
            "end_time": "13:20", 
            "type": "workshop or tutorial", 
            "start_date": "21.10.", 
            "avatar": ""
        }
    ]
}